import { useState } from "react";
import { Ending } from "./Ending.jsx";
import styles from "./Game.module.css";

const Game = () => {
  const [step, setStep] = useState(1);
  const [ending, setEnding] = useState(null);

  const restartGame = () => {
    setStep(1);
    setEnding(null);
  };

  const handleOptionClick = (nextStep) => {
    const nextStepData = steps[nextStep];

    // Якщо є кінцівка, встановлюємо її в стан
    if (nextStepData?.ending) {
      setEnding(nextStepData.ending);
    } else if (nextStepData) {
      setStep(nextStep); // Переходимо до наступного кроку
    } else {
      console.error(`Крок ${nextStep} не знайдено!`);
      setEnding({
        type: "Помилка",
        text: "Крок не знайдено. Спробуйте перезавантажити гру.",
      });
    }
  };
  const steps = {
    1: {
      text: "Ви наближаєтеся до темного лісу, відомого своїми таємницями. Попереду — туманні стежки, які ведуть у глибину. Осінні листя шарудять під ногами, і ви відчуваєте легкий вітерець",
      options: [
        {
          text: "Ви вирішуєте увійти в ліс у сутінках, покладаючись на свою інтуїцію",
          nextStep: 2,
        },
        {
          text: "Ви чекаєте світанку, сподіваючись на допомогу яскравого денного світла.",
          nextStep: 2.1,
        },
      ],
    },
    2: {
      text: "Серед туманних дерев ви помічаєте самотню фігуру, яка виглядає насторожено. Це мандрівник, одягнений у плащ, що прикриває його обличчя",
      options: [
        {
          text: "Вирішуєте допомогти мандрівнику, який шукає втрачений компас",
          nextStep: 3,
        },
        {
          text: "Ігноруєте мандрівника і йдете далі, відчуваючи недовіру.",
          nextStep: 2.2,
        },
      ],
    },
    2.1: {
      text: "На світанку легко побачити сліди, що ведуть з дороги в глиб лісу. Вони здаються свіжими і можуть бути підказкою",
      options: [
        {
          text: "Ви вирішуєте слідувати слідам, відчуваючи, що вони приведуть до чогось важливого",
          nextStep: 3.1,
        },
        {
          text: "Відмовляєтеся від слідів і йдете по наближчій стежці на захід",
          nextStep: 2.3,
        },
      ],
    },
    2.2: {
      text: "На шляху ви побачити сліди, що ведуть з дороги в глиб лісу. Вони здаються свіжими і можуть бути підказкою",
      options: [
        {
          text: "Ви вирішуєте слідувати слідам, відчуваючи, що вони приведуть до чогось важливого",
          nextStep: 3.1,
        },
        {
          text: "Відмовляєтеся від слідів і йдете по наближчій стежці на захід",
          nextStep: 2.3,
        },
      ],
    },
    2.3: {
      text: "Ви робите ще кілька кроків, коли раптово потрапляєте в капкан для ведмедя. Болісно ріжуться металеві зуби, і ви втрачаєте свідомість, втрачаючи багато крові.",
      endings: {
        type: "Кінець",
        text: "Ви загинули на самому початку шляху. Сподіваємось, наступного разу удача буде на вашому боці.",
      },
    },

    3: {
      text: "Вдячний мандрівник дарує вам магічний амулет, що, як він каже, захищає від зла. Амулет тепліє в вашій руці, ніби реагуючи на вашу присутність",
      options: [
        {
          text: "Використовуєте амулет, щоб уникати небезпек, активуючи його силу",
          nextStep: 4.2,
        },
        {
          text: "Тримаєте амулет як сувенір, не вірячи в його магічні властивості",
          nextStep: 4,
        },
      ],
    },
    3.1: {
      text: "Ідучи далі, ви помічаєте дивні знаки на деревах — сліди, наче хтось навмисне залишив їх, щоб попередити чи орієнтувати. Ці знаки виглядають як малюнки, зроблені руками, а деякі з них схожі на сліди крові.",
      options: [
        {
          text: "Ви вирішуєте зібрати кілька крапель, які нагадують кров, щоб дослідити їх пізніше.",
          nextStep: 4.1,
        },
        {
          text: "Продовжуєте шлях, ігноруючи ці дивні маркування, відчуваючи, що вони можуть бути лише випадковими.",
          nextStep: 4.1,
        },
      ],
    },
    4: {
      text: "Ви входите до покинутого табору, серед якого горять багаття. Навколо покинуте спорядження, але натяків на власників нема.",
      options: [
        {
          text: "Ви обшукуєте табір і знаходите стару карту, що веде вглиб лісу",
          nextStep: 5,
        },
        {
          text: "Залишаєте табір неторкнутим і йдете своїм шляхом.",
          nextStep: 5.1,
        },
      ],
    },
    4.1: {
      text: "Ви виходите на галявину, де відчуття затишшя лише підсилює дивну тишу всередині лісу. Хатинка стоїть на іншому кінці.",
      options: [
        {
          text: "Ви йдете прямо до хатинки, відчуваючи, що вас хтось або щось чекає",
          nextStep: 5.2,
        },
        {
          text: "Вирішуєте обстежити територію навколо, перед тим як входити",
          nextStep: 5.3,
        },
      ],
    },
    4.2: {
      text: "Амулет підтверджує свою магію, і перед вами з’являється невидима стежка, що веде навколо і крізь будь-які небезпеки",
      options: [
        {
          text: "Продовжуєте йти стежкою, повністю покладаючись на амулет.",
          nextStep: 5.4,
        },
        {
          text: "Ви зупиняєтеся, бачите що амулет вказує на те, що небезпека вже минула, і вирішуєте обстежити навколо",
          nextStep: 5.5,
        },
      ],
    },
    5: {
      text: "Ви карабкаєтеся по прокладаючих стежках, коли раптом щось клацає, і ви розумієте, що потрапили в пастку.",
      options: [
        {
          text: "Ви намагаєтеся вирватися власними силами, ризикуючи ще більше заплутатися.",
          nextStep: 6,
        },
        {
          text: "Голосно кличете на допомогу, сподіваючись, що хтось почує.",
          nextStep: 6.1,
        },
      ],
    },
    5.1: {
      text: "На краю стежки ви знаходите скриню, оточену невидимими межами енергії, без явного відкриття.",
      options: [
        {
          text: "Ви намагаєтеся зруйнувати невидимий бар’єр силами волі.",
          nextStep: 6.2,
        },
        {
          text: "Пробуєте знайти ключ або іншу підказку, яку залишили попередні шукачі.",
          nextStep: 6.3,
        },
      ],
    },
    5.2: {
      text: "Як тільки ви наближаєтесь до хатинки, вас охоплює дивне відчуття. Вся реальність починає розчинятися, і ви розумієте, що це лише галюцинації, спричинені могутніми чарами лісу. Ліс поглинає вас, і ви більше не в змозі розрізнити, що є істинним, а що — лише ілюзія.",
      endings: {
        type: "Кінець",
        text: "Ви залишились у лісі назавжди, так і не знайшовши таємничого будиночка, який став лише частиною ваших божевільних видінь.",
      },
    },
    5.3: {
      text: "Під час огляду території навколо хатинки ви знаходите прихований вхід у землю, що виглядає давно забутим. Його облямівки покриті мохом і невеликими квітами, які здаються дивно яскравими навіть серед темряви лісу. Вхід веде вниз, і здається, що хтось давно не ступав сюди.",
      options: [
        {
          text: "Вирішуєте спуститися в підземелля, сподіваючись знайти нові таємниці.",
          nextStep: 6.4,
        },
        {
          text: "Обережно підходите до хатинки, відчуваючи, що це може бути пастка.",
          nextStep: 6.5,
        },
      ],
    },

    5.4: {
      text: "Ви знаходите групу туристів, які загубилися і зараз намагаються знайти шлях до будинків.",
      options: [
        {
          text: "Ви вирішуєте допомогти їм знайти дорогу назад.",
          nextStep: 6.6,
        },
        {
          text: "Ви пропонуєте їм приєднатися до пошуків хатинки разом з вами.",
          nextStep: 6.7,
        },
      ],
    },
    5.5: {
      text: "Поки ви обстежуєте навколишню територію, несподівано з-під землі виривається велика хмара отруйного газу. Ви намагаєтеся втекти, але ваша реакція була занадто повільною. Повітря важке і нестерпне, ви відчуваєте, як сили залишають вас, і незабаром втрачаєте свідомість.",
      endings: {
        type: "Кінець",
        text: "Ви не змогли втекти від отруйного газу і загинули, потрапивши в пастку лісу.",
      },
    },
    6: {
      text: "Ваша спроба вирватися з пастки лише ускладнює ситуацію. Ви заплутуєтеся в мотузках та стеблах, і кожен рух лише робить вас більш безпорадними. Ліс навколо стає все темнішим, і ви відчуваєте, як холод охоплює ваше тіло. Раптом чуєте звук, ніби хтось наближається до вас.",
      options: [
        {
          text: "Ви намагаєтесь голосно кликати на допомогу, сподіваючись, що хтось почує вас.",
          nextStep: 6.1,
        },
        {
          text: "Ви вирішуєте залишити всі надії і спробувати знайти власний шлях визволення, навіть якщо це небезпечно.",
          nextStep: 7,
        },
      ],
    },
    6.1: {
      text: "Ви голосно кличете на допомогу, але ліс поглинає ваші крики, і вони не досягають жодного вуха. Навпаки, здається, що звуки навколо тільки посилюються. Раптом ви чуєте, як гілки дерев починають рухатися, і швидко розумієте, що це не людина. Якась темна сутність наближається до вас, її кроки важкі і грізні.",
      endings: {
        type: "Кінець",
        text: "Ваша спроба кликати на допомогу не принесла результату, і тепер ви стали жертвою лісового духу. Ліс поглинув вас назавжди.",
      },
    },
    6.2: {
      text: "Ви намагаєтесь зруйнувати невидимий бар’єр силами волі, зосереджуючи всю свою енергію на тому, щоб розірвати його. Спочатку здається, що він починає слабшати, але раптово з'являється сильний вибух енергії, який відштовхує вас назад. Бар’єр не дає жодної тріщини, а ви виявляєтеся ошелешеними від болю і поранення.",
      endings: {
        type: "Кінець",
        text: "Ваші спроби зруйнувати бар’єр виявилися безуспішними. Задовго після цього, ви залишаєтесь без свідомості, і ваш шлях до скрині назавжди заблокований.",
      },
    },
    6.3: {
      text: "Пробуєте знайти ключ або іншу підказку, яку могли залишити попередні шукачі. Після деяких зусиль, вам вдається помітити під каменем невеликий, прихований знак, схожий на руни. Ви вивчаєте його уважно і розумієте, що це частина коду, який дозволяє активувати механізм відкриття скрині.",
      options: [
        {
          text: "Ви намагаєтеся використати знак для активації механізму.",
          nextStep: 7.1,
        },
        {
          text: "Ви вирішуєте залишити все як є і не намагатися більше відкривати скриню.",
          nextStep: 7.2,
        },
      ],
    },
    6.4: {
      text: "Ви спускаєтеся в підземелля, де темрява майже повністю поглинає світло. Проте, завдяки вашій рішучості, ви продовжуєте рухатись далі, вивчаючи кожен куточок. Внизу ви знаходите стародавні артефакти, що сяють злегка під впливом вашого світла. Один з них — магічний ключ, що, схоже, може відкрити скриню, до якої ви прагнули дістатися.",
      endings: {
        type: "Перемога",
        text: "Ви відкрили скриню та знайшли її таємницю. Це була стародавня магія, здатна змінити долю цілих народів. Ви стали володарем великої сили, і ваше ім’я стало легендою.",
      },
    },
    6.5: {
      text: "Обережно підходите до хатинки, відчуваючи, що це може бути пастка. Але щось в повітрі підказує вам, що цей будинок не такий, як інші. Невідомі символи на дверях і дивні звуки, що долинають зсередини, змушують вас відчути, що тут заховані великі таємниці. Ви приймаєте рішення увійти, попри внутрішній страх, сподіваючись на нові відкриття.",
      options: [
        {
          text: "Ви намагаєтеся відчинити двері і увійти всередину, розуміючи, що це може бути останній шанс.",
          nextStep: 7.5,
        },
        {
          text: "Ви вирішуєте зібратися з силами і відпочити поруч з хатинкою перед тим, як увійти.",
          nextStep: 7.6,
        },
      ],
    },
    6.6: {
      text: "Ви вирішуєте допомогти загубленим туристам. Ведете їх через ліс, використовуючи свій досвід і уважність. Згодом ви разом знаходите дорогу до найближчого села. Туристи вдячні вам за допомогу і запрошують вас на відпочинок до їхнього табору, де ви можете відновити сили після довгого шляху.",
      endings: {
        type: "Кінець",
        text: "Ви виявилися справжнім героєм, врятувавши людей та знайшовши шлях додому. Спільнота вдячна вам за вашу відвагу та допомогу. Це був щасливий кінець вашої подорожі.Але таємниця будиночку досі не відкрита!",
      },
    },
    6.7: {
      text: "Ви пропонуєте туристам приєднатися до пошуків таємничої хатинки, і разом ви вдало долаєте всі труднощі лісу. Після кількох годин пошуків ви нарешті знаходите хатинку, приховану серед густого лісу, її стіни покриті мохом, а вікна злегка заросли плющем. Ліс навколо стає тишею, а повітря наповнюється таємничістю.",
      options: [
        {
          text: "Ви обережно підходите до хатинки, вирішуючи дослідити її зсередини.",
          nextStep: 7.3,
        },
        {
          text: "Ви вирішуєте обійти хатинку, шукаючи інші можливості для дослідження.",
          nextStep: 7.4,
        },
      ],
    },
    7: {
      text: "Ви вирішуєте залишити всі надії і спробувати знайти власний шлях визволення, навіть якщо це небезпечно. Ліс стає все глухішим, і ви відчуваєте, як вас поглинає страх. Раптом натрапляєте на маленьку полянку, де ви бачите старе дерево з вибитими на корі таємничими знаками. Здається, що це може бути підказка до вашого подальшого шляху.",
      options: [
        {
          text: "Ви вирішуєте дослідити дерево та знайти, що це за знаки.",
          nextStep: 7.7,
        },
        {
          text: "Ви ігноруєте дерево та йдете далі, намагаючись шукати інші шляхи для виходу з лісу.",
          nextStep: 5.4,
        },
      ],
    },
    7.1: {
      text: "Ви намагаєтесь використати знак для активації механізму, але через поспіх чи неуважність неправильно трактуєте символи. Механізм спрацьовує не так, як ви очікували. Ви чуєте гучний звук, і раптово скриня вибухає, випускаючи отруйний газ. Ваша спроба відкрити її призводить до непоправних наслідків.",
      endings: {
        type: "Кінець",
        text: "Ви загинули через свою необачність. Не поспішайте в наступний раз.",
      },
    },
    7.2: {
      text: "Ви вирішуєте залишити все як є і не намагатися більше відкривати скриню. Ризикувати, здається, не варто, і ви розумієте, що скриня може бути частиною більшої загадки. Ви продовжуєте досліджувати навколишню територію, сподіваючись знайти нові підказки, які допоможуть вам досягти мети.",
      options: [
        {
          text: "Ви вирішуєте рухатись далі в пошуках нових підказок.",
          nextStep: 8,
        },
        {
          text: "Ви вирішуєте повернутися до того місця, де знайшли перший знак.",
          nextStep: 8.1,
        },
      ],
    },
    7.3: {
      text: "Ви намагаєтеся відчинити двері і увійти всередину, розуміючи, що це може бути ваш останній шанс. Як тільки двері відкриваються, ви відчуваєте потужний сплеск енергії, що проникає в ваше тіло. Всередині хатинки темно, але по мірі того, як ви входите, стародавні руни на стінах починають світитися, відкриваючи вам доступ до неймовірної сили. Ви відчуваєте, як ваш розум розширюється, а тіло наповнюється невідомою енергією. Однак, через цей процес, всі туристи, які йшли з вами, не витримали й загинули від сили таємничого впливу. Ви залишаєтесь єдиним живим свідком цієї сили.",
      endings: {
        type: "Перемога",
        text: "Ви здобули неймовірну могутність, але за це заплатили надзвичайну ціну. Туристи загинули, і тепер ви маєте велику відповідальність за силу, яку отримали. Чи будете ви використовувати її для добра чи зла — тепер це залежить від вас.",
      },
    },
    7.4: {
      text: "Ви вирішуєте обійти хатинку, шукаючи інші можливості для дослідження. Ваша увага переключається на один з туристів, який, не витримавши, вирішує самостійно увійти в будиночок. Як тільки він перетинає поріг, ви чуєте різкий звук, ніби щось активувалося всередині. Сила, що вирвалася з хатинки, поглинає його, і незабаром він починає випромінювати дивовижну енергію. Але ці зміни не обіцяють йому добра: всі інші туристи, що знаходились поблизу, безслідно зникають, і ви залишаєтесь на самоті. Будинок, наче поглинув усіх, хто наблизився до нього, і тепер ваша місія — зрозуміти, чи є ще шанс вибратися.",
      endings: {
        type: "Кінець",
        text: "Ви залишилися один, безтурботно зітхаючи, і ваше майбутнє тепер залежить від того, чи зможете ви самі пережити це випробування. Туристи загинули, а сила, яку отримав ваш товариш, ймовірно, стала вашою найбільшою загрозою.",
      },
    },
    7.5: {
      text: "Ви намагаєтеся відчинити двері і увійти всередину, розуміючи, що це може бути останній шанс. Крок за кроком, ваше тіло напружене від хвилювання, але ви все ж переступаєте поріг. Внутрішній простір будинку вражає: він набагато більший, ніж ви очікували, і здається, що всередині приховані десятки таємниць. Як тільки ви ступаєте всередину, ваше тіло наповнюється незвичайною енергією, а в голові починають з'являтися розрізнені думки і спогади. Ви нарешті розумієте всі загадки цього місця. Цей будинок був створений для того, щоб випробовувати шукачів, і ви, безумовно, стали одним з найуспішніших. Ви отримали доступ до всіх таємниць, що зберігалися тут століттями. Але на цьому не завершується ваш шлях — ви маєте можливість покинути це місце, взявши з собою нову силу, або залишитися тут, зберігши все, що дізналися, і прийнявши відповідальність за вивчені таємниці.",
      options: [
        {
          text: "Ви вирішуєте залишити це прокляте місце і повернутися назад, знаючи, що ваша місія завершена.",
          nextStep: 8.2,
        },
        {
          text: "Ви залишаєтеся, спокушені величезною силою і знаннями, які тепер стали частиною вас.",
          nextStep: 8.3,
        },
      ],
    },
    7.6: {
      text: "Ви вирішуєте зібратися з силами і відпочити поруч з хатинкою перед тим, як увійти. Сідаєте на землю, намагаєтеся заспокоїтися і відновити сили після всього, що відбулося. Але як тільки ви закриваєте очі, відчуваєте, що повітря навколо стає важким. Ваша свідомість починає затуманюватися, і ви чуєте, як щось наближається до вас. Перш ніж встигнути зреагувати, вас охоплює холод, і ви розумієте, що це — пастка, яку не можна уникнути. Перед тим, як втрачаєте свідомість, ви відчуваєте, як вас поглинає темрява.",
      endings: {
        type: "Кінець",
        text: "Ви не змогли втекти від небезпеки. Туман навколо хатинки був смертельною пасткою, і ви стали її жертвою. Ця тиша стала вашою останньою.",
      },
    },
    7.7: {
      text: "Ви вирішуєте дослідити дерево та знайти, що це за знаки. Крок за кроком ви уважно вивчаєте кору і, зрештою, знаходите те, що шукали — маленький камінь, вмурований у стовбур дерева. На ньому вигравірувано символ, який відповідає тим, що ви бачили раніше. Поруч з каменем ви знаходите невеликий механізм, який відкриває секретний шлях. Ви відчуваєте, як перед вами розкривається новий шлях, і серце наповнюється надією. Ось воно — ключ до вашого порятунку.",
      endings: {
        type: "Перемога",
        text: "Ви знайшли шлях до порятунку. Завдяки розгадці стародавнього знака вам вдалося вибратися з лісу і віднайти свою свободу. Хоча це був важкий шлях, ви змогли пройти його і залишити все позаду, залишивши ліс і його таємниці позаду.",
      },
    },
    8: {
      text: "Ви вирішуєте рухатись далі в пошуках нових підказок. Поступово, долаючи труднощі та небезпеки, ви починаєте помічати деталі, які раніше залишалися непоміченими: старі сліди, згаслі вогнища, сліди незнайомих істот. Ваші зусилля не були марними — на вашому шляху з'являється нова підказка, яка відкриває шлях до істинної мети. Ви відчуваєте, що наближаєтесь до розгадки.",
      endings: {
        type: "Перемога",
        text: "Ваше терпіння і рішучість призводять до успіху. Завдяки уважному дослідженню та правильним виборам вам вдалося розкрити таємниці цього лісу і знайти шлях до порятунку. Ви залишаєте ліс, не тільки живим, але й з новими знаннями та мудрістю, готовим до нових пригод.",
      },
    },
    8.1: {
      text: "Ви вирішуєте повернутися до того місця, де знайшли перший знак. На жаль, коли ви прибуваєте туди, помічаєте, що знак зник, а навколо панує дивна тиша. Ліс, здавалося б, змінився, став ще більш загрозливим і неприязним. Ви намагаєтеся знайти нові підказки, але кожен ваш крок веде до ще більш заплутаних ситуацій. Зрозуміло, що ви заблукали, і тепер ваше становище стає критичним.",
      endings: {
        type: "Кінець",
        text: "Ви залишаєтеся заблукалими в лісі, і, незважаючи на всі ваші зусилля, не можете знайти вихід. Ліс поглинув вас, і ви стаєте частиною його таємниць.",
      },
    },
    8.2: {
      text: "Ви вирішуєте залишити це прокляте місце і повернутися назад, знаючи, що ваша місія завершена. Підвладні новій силі, ви відчуваєте, як вона допомагає вам уникнути всіх небезпек, що раніше були над вами. Ліс, який здавалося, був безжальним і загрозливим, тепер стає тихим і безпечним. Ви виходите з цього місця з легкістю, вражаючи світ своєю перемогою та новими знаннями. Ви залишаєте таємничий будинок позаду, але ніколи не забудете ті неймовірні відкриття та сили, які стали частиною вас.",
      endings: {
        type: "Перемога",
        text: "Ви повертаєтесь до цивілізації, перемагаючи всі труднощі і отримавши неймовірну силу та знання, які відкривають нові можливості. Тепер ви розумієте, що справжня мета цієї подорожі була не лише в пошуках таємниць, а й у власному вдосконаленні.",
      },
    },
    8.3: {
      text: "Ви залишаєтеся, спокушені величезною силою і знаннями, які тепер стали частиною вас. Відчуваєте, як ваша свідомість розширюється, але поступово починаєте усвідомлювати, що ви стали частиною цього місця. Непомітно для себе, ви починаєте втрачати зв'язок з реальністю, а сили, які ви отримали, стають дедалі більш деструктивними. Усі таємниці, якими ви були спокушені, починають вас поглинати. Ви стаєте нескінченною частиною цього проклятого будинку, захоплені його магією і силами, що вже не підконтрольні вам.",
      endings: {
        type: "Програш",
        text: "Ви залишаєтесь в цій пастці, де ваша свідомість і сила стають лише частиною зловісного циклу, що ніколи не завершиться. Ваша подорож закінчилася, і тепер ви — частина легенди цього місця.",
      },
    },
  };

  return (
    <div className={styles.game}>
      {ending ? (
        <Ending {...ending} onRestart={restartGame} />
      ) : (
        <div>
          <h2>{steps[step]?.text}</h2>
          <div className={styles.options}>
            {steps[step]?.options?.map((option, index) => (
              <button
                key={index}
                onClick={() => handleOptionClick(option.nextStep)}
              >
                {option.text}
              </button>
            ))}
          </div>
        </div>
      )}
    </div>
  );
};

export default Game;
